## '##' pandas 라이블러리 포함
### '###'pandas 라이블러리 포함
#### '####'pandas 라이블러리 포함
# '#'의 크기가 많을수 글씨가 작아짐

# series-1차원 벡터 데이터에 행방향 인덱스를 붙인것
dataFrame -2차원 행과 열의 형태로 표현되는 것

In [3]:
import pandas as pd
data = [1, 2, 3, 4, 5, 6, 7 ,8, 9, 10, 11, 12, 'ㅇ' ]
s = pd.Series(data)
print(s)

0      1
1      2
2      3
3      4
4      5
5      6
6      7
7      8
8      9
9     10
10    11
11    12
12     ㅇ
dtype: object

In [21]:
dic = {'100':'남', '200': '여', '300': '', '400': '여', '500':'남'}
gender = pd.Series(dic)
gender

100    남
200    여
300
400    여
500    남
dtype: object

In [23]:
name = pd.Series({'100':'다밀시', '200': '이비주', '300': '리내바', '400': '로바시', '500':'가하기'})
name

100    다밀시
200    이비주
300    리내바
400    로바시
500    가하기
dtype: object

In [4]:
#데이터프레임 사용
회원 = pd.DataFrame({
    '회원번호':['100', '101', '102', '103', '104', '105', '106', '107'],
      '성별':['남', '여','남', '','남', '여','남','남'],
    '이름':['이신하', '이일하', '이이하', '이삼하', '이사하', '이오하','이육하','이칠하',] 
}
)
회원 = 회원.set_index('회원번호')
회원

     성별   이름
회원번호
100   남  이신하
101   여  이일하
102   남  이이하
103      이삼하
104   남  이사하
105   여  이오하
106   남  이육하
107   남  이칠하

In [5]:
회원['성별']=='여'

회원번호
100    False
101     True
102    False
103    False
104    False
105     True
106    False
107    False
Name: 성별, dtype: bool

In [7]:
회원[회원['성별']=='여']

     성별   이름
회원번호
101   여  이일하
105   여  이오하

In [9]:
회원.loc['102']['이름'] = '이2하'
회원

     성별   이름
회원번호
100   남  이신하
101   여  이일하
102   남  이2하
103      이삼하
104   남  이사하
105   여  이오하
106   남  이육하
107   남  이칠하

In [ ]:
q